<html>
<!-- Created on: 6/29/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware"> 
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
</head>
<body>
		
		<div id="hlavicka">
		<p>Robotický seminá&#345; </p>
		</div>
	
		 <div id="hlavni">
		   </br>	 
	 	   <h2> <u>Data hubs, startovní bod, sequence beam</u></h2>
		   
		   <h3> <u>Data hubs</u></h3>
		   		 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V&#283;t&scaron;ina programovacích blok&#367; p&#345;ichází s funkcionalitou, 
						  která se nazývá Data hub. Pokud najedete kurzorem my&scaron;i nad levou spodní
						   &#269;ást programovacího bloku (Obr. 1), který   je ji&#382; umíst&#283;n 
						   na programovací plo&scaron;e, tak se objeví oboustranná &scaron;ipka. 
						   Kliknutím se rozbalí <i>Data hub</i> nabídka (Obr. 2). Pokud znovu kliknete na stejné místo,
						    tak se nabídka zav&#345;e. V levé &#269;ásti této nabídky se nachází vstupní zástr&#269;ky
							 a v pravé výstupní zástr&#269;ky. Po najetí kurzoru my&scaron;i  
							  nad zástr&#269;ku se &scaron;ipka zm&#283;ní v symbol, který vypadá jako &bdquo;svazek drátu&ldquo;.
							   Po kliknutí p&#345;ejdete do re&#382;imu &bdquo;kreslení&ldquo; datového spojení a m&#367;&#382;ete 
							   tak vytvo&#345;it spojení z výstupní zástr&#269;ky jednoho bloku do vstupní zástr&#269;ky druhého bloku.
							    Datovým spojením lze p&#345;ená&scaron;et informaci ve form&#283; &#269;ísla,
								 textu nebo form&#283; jiných hodnot. Správn&#283; vytvo&#345;ené spojení je znázorn&#283;no plnou
								  &#269;arou. Spojení pro p&#345;enos &#269;íselných dat je ozna&#269;eno &#382;lutou &#269;arou,
								   textová data oran&#382;ovou &#269;arou a data ve form&#283; logických hodnot zelenou &#269;arou. 
								   Nesprávné propojení dvou zástr&#269;ek je znázorn&#283;né te&#269;kovanou &scaron;edou &#269;arou.
</br> 										   
								     <center> <img src="obrazky/Data hub.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 1: Zde klikn&#283;te pro otev&#345;ení Data hub nabídky</font> </center>  
								  
</br> 	
								     <center> <img src="obrazky/Data hub 2.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 2: Data hub nabídka bloku Move se vstupními a výstupními zástr&#269;kami</font> </center> 		
						 
</br> </br>	
						 
 </ol>
<h3> <u>Startovní bod</u></h3> 		

						 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kdy&#382; za&#269;nete vytvá&#345;et program, tak první blok se v&#382;dy umís&#357;uje
						 na programovací plo&scaron;e do místa, kde je modrým písmem napsáno &bdquo;<i>Start&ldquo;</i>. 
						 Toto místo je spojené s oblastí, která           se nazývá &bdquo;startovní bod&ldquo; (Obr. 3).
						  Poznáte ho podle symbolu LEGO MINDSTORMS NXT programu. Pokud kliknete na tla&#269;ítko pro sta&#382;ení 
						  programu do NXT kostky, tak budou sta&#382;eny jen ty bloky, které jsou spojené
						   se &bdquo;startovním bodem&ldquo;. Ostatní bloky, které se nachází voln&#283;    
						    na programovací plo&scaron;e, sta&#382;eny nebudou.		
							
</br>		
						<center> <img src="obrazky/startovni bod.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 3: Startovní bod a oblast pro umíst&#283;ní prvního bloku</font> </center> 							
</br>
						 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; P&#345;i kliknutí na &bdquo;startovní bod&ldquo; nebo p&#345;i pouhém najetí kurzoru my&scaron;
						 i nad n&#283;j                    se v konfigura&#269;ním panelu objeví textové pole, 
						 kde m&#367;&#382;ete napsat poznámky ke svému programu. Tyto poznámky jsou ulo&#382;eny 
						 spole&#269;n&#283; s programem.   
						 
</br> </br>

 </ol>
<h3> <u>Sequence beam</u></h3> 		

						  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Tento anglický výraz lze doslova p&#345;elo&#382;it jako &bdquo;sekven&#269;ní 
						 paprsek&ldquo;. Proto&#382;e m&#283;            do &#269;e&scaron;tiny nenapadl &#382;ádný
						  lep&scaron;í p&#345;eklad, tak budu pou&#382;ívat doslovný p&#345;eklad uvedený vý&scaron;e.
						   Abyste lépe pochopili, o co se jedná, musíte se podívat na Obr. 3. 
						   Jsou to t&#345;i bílé výb&#283;&#382;ky s kruhovým otvorem, které vychází ze &bdquo;startovního bodu&ldquo;. 
						   
						   Hlavní &bdquo;sekven&#269;ní paprsek&ldquo; je spojen s místem,
						    kam se umístí první blok. &bdquo;Sekven&#269;ní paprsek&ldquo; &#345;ídí tok va&scaron;eho programu. 
							Ur&#269;uje po&#345;adí, v jakém budou jednotlivé bloky vykonány. Bloky, které jsou spojeny
							 &bdquo;sekven&#269;ním paprskem&ldquo;, který vychází ze startovního bodu, mohou být sta&#382;eny 
							 do NXT kostky. Ostatní bloky, které nejsou takto spojeny, sta&#382;eny nebudou. 
							 Ze &bdquo;startovního bodu&ldquo; lze vytvo&#345;it paralelní &bdquo;sekven&#269;ní paprsek&ldquo;,
							  který umo&#382;ní sou&#269;asné vykonávání blok&#367;. Nap&#345;íklad NXT 
							  kostka m&#367;&#382;e vydávat n&#283;jaký zvuk a zárove&#328; na displeji m&#367;&#382;e
							   být zobrazen n&#283;jaký text (Obr. 4). 
</br> 						   
							  <center> <img src="obrazky/Obr. 1.36.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 4: P&#345;íklad paralelního b&#283;hu programu</font> </center> 
</br> 
						  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;	Paralelní v&#283;tev vytvo&#345;íte tak,
						   &#382;e najedete kurzorem my&scaron;i na horní nebo spodní výb&#283;&#382;ek 
						    ze &bdquo;startovního bodu&ldquo; a &scaron;ipka se zm&#283;ní ve &bdquo;svazek drátu&ldquo;,
							 jako tomu bylo u <i>data hubs</i>. Kliknutím a pohybem my&scaron;i za&#269;nete vytvá&#345;et 
							 nový &bdquo;sekven&#269;ní paprsek&ldquo;, který m&#367;&#382;ete p&#345;ipojit 
							 k programovacím blok&#367;m. Kdy&#382; stáhnete program do NXT kostky a spustíte jej, 
							 tak bloky        na obou &bdquo;sekven&#269;ních paprscích&ldquo; budou vykonávány 
							 sou&#269;asn&#283;. Pou&#382;itím datových spojení mohou bloky na paralelních v&#283;tvích 
							  spolu komunikovat.
</br>
							&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Paralelní v&#283;tev nemusíte vytvá&#345;et
							 jen ze &bdquo;startovního bodu&ldquo;, ale také i z jiného místa    
							   ve va&scaron;em programu. Ud&#283;láte to tak, &#382;e kurzor my&scaron;i
							    p&#345;esunete na místo, odkud chcete vytvo&#345;it nový &bdquo;sekven&#269;ní
								 paprsek&ldquo;. Zobrazí se oboustranná &scaron;ipka. Musíte dr&#382;et stisknutou 
								 klávesu <i>Shift</i>, aby se objevil ji&#382; zmi&#328;ovaný &bdquo;svazek drátu&ldquo;.
								  Kliknutím a pohybem my&scaron;i m&#367;&#382;ete za&#269;ít vytvá&#345;et nový
								   &bdquo;sekven&#269;ní paprsek&ldquo;.		
								   
								   



		   
		 </div>

</body>
</html>
