<html>
<!-- Created on: 6/25/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware">
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
</head>
<body>
	<div id="hlavicka">
	<p>Robotický seminá&#345; </p>
	</div>
	
	<div id="hlavni">
		  </br>
	      <h1> <u>Návod na programování v NXT-G</u></h1></br>
		  
		  <h3> <u>1 Programování NXT kostky</u> - úvodní informace</h3>
		  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Existuje mnoho odli&scaron;ných zp&#367;sob&#367; pro psaní 
		  program&#367;, které budou NXT kostkou vykonány. V Tab. 1 jsou shrnuty základní charakteristiky
		   nejpou&#382;ívan&#283;j&scaron;ích programovacích jazyk&#367;. </br>
		  <center> <img src="obrazky/Tabulka.png"> </center> 
		 <center> <font size="2" color="#000066" face="arial">Tab. 1: 
		 P&#345;ehled programovacích jazyk&#367; a jejich vlastností </font> </center> </br>
		 Pro lep&scaron;í pochopení problematiky je pot&#345;eba vysv&#283;tlit <a href="pojmyNXT.html"> N&#282;KOLIK ZÁKLADNÍCH POJM&#366;. </a> </br> </br>
		  
		 <h4> <u>1.1 NXT - G</u></h4>
		 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;NXT &ndash; G je nástroj, který slou&#382;í k tomu, abyste va&scaron;emu robotovi &#345;ekli, 
		 co má d&#283;lat. Tento nástroj vám dovolí vytvá&#345;et programy, které pak nahrajete do va&scaron;eho MINDSTORMS robota. 
		 M&#367;&#382;e se jednat o jednoduché instrukce nebo o rozsáhlé a náro&#269;né programy. V názvu tohoto programovacího jazyka 
		 se za poml&#269;kou vyskytuje písmeno &bdquo;G&ldquo;, co&#382; je za&#269;áte&#269;ní písmeno anglického slova Graphical. To znamená, 
		 &#382;e program není slo&#382;en z instrukcí, které jsou v textové podob&#283;, ale program je vytvá&#345;en v grafickém prost&#345;edí
		  pomocí programovacích blok&#367;. Ty se jednodu&scaron;e &#345;e&#269;eno skládají za sebou. </br> </br>
		  
		  <h4> <u>1.2 Za&#269;ínáme s programem LEGO MINDSTORMS NXT</u></h4>
		  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Programovací prost&#345;edí LEGO MINDSTORMS NXT bylo kompletn&#283; vytvo&#345;eno podle grafického programovacího softwaru 
		  LabVIEW, který je ur&#269;en pro návrh automatických m&#283;&#345;ících a &#345;ídících systém&#367;. U&#382;ivatelé LabVIEW 
		  si mohou v&scaron;imnout mnoha podobenství mezi programem LEGO MINDSTORMS NXT a LabVEW, proto&#382;e National Instruments
		   a LEGO spolupracovali na tom, aby byly zachovány v&scaron;echny klí&#269;ové grafické programovací prvky pou&#382;ívané
		    v LabVIEW  proto, aby bylo u&#382;ivatelské rozhraní optimalizováno i pro &bdquo;nová&#269;ky&ldquo; v u&#382;ívání 
			po&#269;íta&#269;&#367;. Programování je zalo&#382;eno na principu drag-and-drop (&bdquo;táhni a pus&#357;&ldquo;). 
			Pomocí tohoto principu jsou z panelu na levé stran&#283; obrazovky p&#345;esouvány programovací bloky na programovací 
			plochu programu. Ka&#382;dý blok má unikátní funkci jako nap&#345;íklad pohyb motor&#367;, detekce zvuku, zobrazení 
			zprávy nebo t&#345;eba m&#283;&#345;ení vzdálenosti. R&#367;znými kombinacemi blok&#367;  se vytvo&#345;í program, 
			který poté nahrajete do NXT kostky. Zkompilovaný program je do NXT kostky p&#345;enesen pomocí USB kabelu nebo pomocí 
			Bluetooth bezdrátového p&#345;ipojení.</br>
			&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Existují dv&#283; podoby softwaru LEGO MINDSTORMS NXT. První je sou&#269;ástí 
			NXT robotické stavebnice, kterou 
			lze koupit v kamenném obchod&#283;. Tato verze se n&#283;kdy ozna&#269;uje jako retail - maloobchodní. Druhá 
			je sou&#269;ástí NXT stavebnice, která se dá po&#345;ídit v LEGO Educational Division a má v názvu dopln&#283;no 
			education - výuková. Výuková verze je hlavn&#283; po&#345;izována &scaron;kolami nebo &scaron;kolícími centry, 
			ale koupit p&#345;es internet si ji samoz&#345;ejm&#283; m&#367;&#382;e kdokoliv. Na Obr. 1 je vid&#283;t 
			maloobchodní verze se sekcí Robo Center a na Obr. 2 je výuková verze se sekcí Robot Educator . 
			Robo Center je pr&#367;vodce, kde jsou krok po kroku instrukce pro sestavení a naprogramování &#269;ty&#345; 
			NXT robotických model&#367;. Robot Educator je místo, kde se nau&#269;íte programovat va&scaron;eho 
			robota pomocí 39 programovacích p&#345;íklad&#367;. Maloobchodní a výuková verze jsou v 90 procentech stejné a 
			li&scaron;í se pouze v pár funkcích. Ovládání programu je velmi jednoduché a intuitivní.</br>
			
			<center> <img src="obrazky/retailNXT.png"> </center>
			<center> <font size="2" color="#000066" face="arial">Obr. 1: Maloobchodní 
			verze programu LEGO MINDSTORMS NXT s Robo Center </font> </center> </br>
			
			<center> <img src="obrazky/educationNXT.png"> </center>
			<center> <font size="2" color="#000066" face="arial">Obr. 2: Výuková verze programu 
			LEGO MINDSTORMS NXT v2.0 s Robot Educator  </font> </center> </br>
			
			<h3> <u>2 Instalace a první spu&scaron;t&#283;ní - více <a href="instalaceNXT.html">ZDE</a> </u></h3> </br>
			
			<h3> <u>3 Popis programovacího prost&#345;edí - více <a href="popisNXT.html">ZDE</a> </u></h3> </br>
			
			<h3> <u>4 Vytvo&#345;ení, ulo&#382;ení, otev&#345;ení programu - více <a href="praceSprogramemNXT.html">ZDE</a> </u></h3> </br> 
			
			<h3> <u>5 Programovací bloky - více <a href="blokyNXT.html">ZDE</a> </u></h3> </br> 
			
			<h3> <u>6 Data hubs, startovní bod, sequence beam - více <a href="dataHubSB.html">ZDE</a> </u></h3> </br>
			
			<h3> <u>7 Vlastní bloky - více <a href="vlatniBlokNXT.html">ZDE</a> </u></h3> </br>
			
			<h3> <u>8 Prom&#283;nné v NXT - G - více <a href="promennaNXT.html">ZDE</a> </u></h3> </br>   
			
			<h3> <u>9 Práce se soubory - více <a href="souboryNXT.html">ZDE</a> </u></h3> </br>
			
			<h3> <u><a href="literaturaNXT.html">Literatura</a></u></h3> </br>
			
			       
		   																																 
	</div>
	
</body>
</html>
