<html>
<!-- Created on: 6/25/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware">
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
</head>
<body>
	   <div id="hlavicka"> 
	   <p>Robotický seminá&#345; </p>
	   </div>
	
	   <div id="hlavni">
	   		</br>
	   	    <h2> <u>Základní pojmy</u></h2> 
			<ul>
      		<li><b> Robot </b> - Existuje nespo&#269;etné mno&#382;ství definic pojmu robot. Jedna z definic &#345;íká,
			            &#382;e je to elektrické za&#345;ízení, které funguje nezávisle na tom, ani&#382; by ho
						 &#345;ídil &#269;lov&#283;k. M&#367;&#382;eme také &#345;íci, &#382;e robot je stroj, který
						  vykonává podobné &#269;innosti jako &#269;lov&#283;k, p&#345;edev&scaron;ím v&scaron;ak &#269;innosti
						   pohybové a manipula&#269;ní. V&#283;t&scaron;inou musí takový stroj získávat informace o prost&#345;edí,
						    ve kterém se pohybuje. Musí být schopen toto prost&#345;edí ovliv&#328;ovat jak fyzikáln&#283;, tak i mechanicky.
							 Informace z prost&#345;edí získává pomocí senzor&#367;. Senzor  je za&#345;ízení, které je schopné m&#283;&#345;it 
							 n&#283;jakou vlastnost prost&#345;edí. Senzorem m&#367;&#382;e být t&#345;eba  i oby&#269;ejný spína&#269;. Tento 
							 spína&#269; m&#367;&#382;e robot nap&#345;íklad vyu&#382;ít jako nárazník. Naopak p&#367;sobit na okolní 
							 prost&#345;edí m&#367;&#382;e robot pomocí efektor&#367;. Typickým p&#345;íkladem efektoru  je elektromotor. 
							 Po jeho p&#345;ipojení na kolo umo&#382;&#328;uje robotovi pohyb. V závislosti na velikosti robota se m&#367;&#382;eme 
							 setkat i s dal&scaron;ími typy efektor&#367;, a&#357; u&#382; to jsou spalovací motory &#269;i hydraulika. Ka&#382;dý robot 
							 také musí mít zdroj energie, kterým je nej&#269;ast&#283;ji akumulátor. Ten poskytuje energii senzor&#367;m, &#345;ídící 
							 jednotce i v&#283;t&scaron;in&#283; efektor&#367;.  </li> </br>  
      		<li><b>Algoritmus </b> - Je to schematický postup, který je ur&#269;ený pro &#345;e&scaron;ení ur&#269;itých druh&#367; problém&#367; 
			        a který je provád&#283;n pomocí kone&#269;ného mno&#382;ství p&#345;esn&#283; definovaných krok&#367;.</li>	</br>
			<li><b>Program</b> - Postup operací, který popisuje realizaci dané úlohy. Jednodu&scaron;e se dá &#345;íci,    
			        &#382;e se jedná o posloupnost instrukcí pro na&scaron;eho robota. Program je vytvá&#345;en osobou - programátorem, zápisem algoritmu 
					v n&#283;jakém programovacím jazyku. </li> </br>
			<li><b>Programovací jazyk</b> - Jedná se o jazyk slou&#382;ící k tvorb&#283; program&#367;. Je to prost&#345;edek   pro zápis algoritm&#367; 
			a slou&#382;í jako komunika&#269;ní nástroj mezi programátorem a po&#269;íta&#269;em. Jako lidé mluví r&#367;znými jazyky, tak i roboti (ale i 
			po&#269;íta&#269;e a dal&scaron;í za&#345;ízení) mluví r&#367;znými jazyky. Nap&#345;íklad lidé na na&scaron;í planet&#283; mluví angli&#269;tinou, 
			n&#283;m&#269;inou, ru&scaron;tinou, &scaron;pan&#283;l&scaron;tinou, atd. I NXT programovací kostka rozumí r&#367;zným jazyk&#367;m. Mým rodným jazykem 
			je &#269;e&scaron;tina. Pro NXT kostku je &bdquo;rodným&ldquo; jazykem NXT &ndash; G. Ve &scaron;kole jsem se nau&#269;il mluvit anglicky, ale m&#367;j rodný jazyk to není. 
			NXT kostka se také m&#367;&#382;e nau&#269;it &bdquo;rozum&#283;t&ldquo; dal&scaron;ím jazyk&#367;m. Jako u lidí, tak i zde platí, &#382;e d&#345;íve ne&#382; se za&#269;neme 
			u&#269;it cizímu jazyku, tak je pot&#345;eba dokonale rozum&#283;t jazyku rodnému.</li> </br>
			<li><b>Programování</b> - Ozna&#269;uje &#269;innost, p&#345;i které je vytvá&#345;en (psán) program. </li> </br>
			<li><b>Software</b> = programové vybavení </li> 
     	   </ul>  
			
	   </div>
	   	 
</body>
</html>
