<html>
<!-- Created on: 6/25/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware">
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
</head>
<body>
		<div id="hlavicka">	
		<p>Robotický seminá&#345; </p>
		</div>
	
	<div id="hlavni">
		  </br>	 
	 	  <h2> <u>Popis programovacího prost&#345;edí</u></h2>
		  <center> <img src="obrazky/popisProgramu.png"> </center> </br>
		  <b> 1 - Roletové nabídky </b> </br>
		  Na vrchní li&scaron;t&#283; okna se nachází 4 roletové nabídky s dal&scaron;ími podnabídkami:
		  <ul>
		  		<li><i><u>F</u>ile</i> </br> 
				 - <i>New</i> </br>
				 - <i>Open</i> </br>
				 - <i>Close</i> </br>
				 - <i>Save</i>  </br>
				 - <i>Save As</i>  </br>
				 - <i>Page Setup</i> </br>
				 - <i>Print</i>  </br>
				 - <i>Exit</i>  </br> </br>
				</li>
				
				<li> <i><u>E</u>dit</i> </br>
				  - <i>Make a New My Block</i> </br>
				  - <i>Edit Selected My Block</i> </br>
				  - <i>Edit My Block Icon</i> </br>
				  - <i>Manage Custom Pallete</i> </br>
				  - <i>Manage Profiles</i> </br>
				  - <i>Define Constants</i> </br> </br>  
				</li>
				
				<li> <i><u>T</u>ools</i> </br>
				  - <i>Calibrate Sensors</i> </br> 
				  - <i>Update NXT Firmware</i> </br> 
				  - <i>Block Import and Export Wizard</i> </br>
				  - <i>Download to Multiple NXTs</i> </br> </br>
				</li>
				
				<li> <i><u>H</u>elp</i> </br>
				  - <i>Contents and Indexes</i> </br>
				  - <i>Online Support</i> </br>
				  - <i>Online Updates</i> </br>
				  - <i>Register Product</i> </br>
				  - <i>About LEGO MINDSTORMS Edu NXT</i> </br> </br>  
				</li>
		  </ul>
		  
		  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Nabídky obsahují &#269;asto pou&#382;ívané funkce a lze je aktivovat 
		  bu&#271; pomocí levého tla&#269;ítka my&scaron;i nebo kombinací Alt + 
		  podtr&#382;ené písmeno. Obdobným zp&#367;sobem lze aktivovat i jednoduché 
		  p&#345;íkazy v nabídce. </br> </br>
		  
		  Postup: 
		  <ul>
		    <li>Kurzor my&scaron;i nastavte na p&#345;íslu&scaron;ný název nabídky a klikn&#283;te.</li>
			<li>Po otev&#345;ení nabídky vyberte kurzorem &#382;ádanou funkci a op&#283;t na ni klikn&#283;te.</li>
			<li>Alternativn&#283; p&#345;idr&#382;te stisknutou klávesu Alt a stiskn&#283;te klávesu odpovídající 
			podtr&#382;enému písmenu v názvu nabídky.</li> </br> 
		  </ul>
		  
		  <b>2 - Li&scaron;ta s tla&#269;ítky pro rychlé spu&scaron;t&#283;ní</b> </br> </br>
		  
		  <b>3 - Tla&#269;ítko </b> pro p&#345;epínání mezi programem <i>NXT Data Logging</i> a <i>NXT 
		         Programming Software</i></br> </br>
		 
		  <b>4 - Paleta s programovacími bloky</b> </br>
		  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Programovací paleta obsahuje v&scaron;echny programovací bloky, 
		  které budete pot&#345;ebovat pro vytvá&#345;ení va&scaron;ich program&#367;. 
		  Pro jednoduché pou&#382;ívání je programovací paleta rozd&#283;lena do t&#345;í men&scaron;ích palet, 
		  mezi kterými se p&#345;epíná pomocí zálo&#382;ek ve spodní &#269;ásti této sekce. Palety jsou následující: </br>
		  <ul>
		   <li> <i>Common palette </i> - Je to paleta, která obsahuje nejpou&#382;ívan&#283;j&scaron;í bloky. 
		   Primárn&#283; je nastavena jako výchozí bod.</li>
		   <li><i>Complete pallete </i> - Tato paleta obsahuje kompletn&#283; v&scaron;echny programovací bloky.</li>
		   <li> <i>Custom pallete</i> - V této palet&#283; najdete sta&#382;ené bloky z webu a vlastn&#283; vytvo&#345;ené.</li> </br>
		  </ul>  		 																										   
		  
		  <b>5 - Oblast pro konfigura&#269;ní panel </b> - V této &#269;ásti obrazovky se zobrazuje konfigura&#269;ní panel. Ka&#382;dý
		   programovací blok má sv&#367;j unikátní konfigura&#269;ní panel, kde m&#367;&#382;ete specifikovat nastavení vybraného bloku. </br> </br>
		   
		  <b>6 - Programovací okno  </b> - Nachází se zde programovací plocha, na ní&#382; 
		  budete spojovat bloky do sekvence. Mezi jednotlivými programy se p&#345;epíná pomocí 
		  zálo&#382;ek v horní &#269;ásti programovacího okna. Pro uzav&#345;ení aktivní programovací 
		  plochy slou&#382;í &bdquo;k&#345;í&#382;ek&ldquo; napravo od zálo&#382;ek. </br> </br>
		  
		  <b>7 - <i>Controller</i>  </b> - Obsahuje p&#283;t tla&#269;ítek, která slou&#382;í 
		  ke komunikaci mezi po&#269;íta&#269;em a NXT kostkou. Pomocí nich m&#367;&#382;ete stáhnout 
		  program (nebo jen jeho &#269;ást) do NXT kostky. Jedno z p&#283;ti tla&#269;ítek je ur&#269;ené 
		  k otev&#345;ení okna s informacemi o NXT kostce. </br> </br>
		  
		  <ul>
		  	<li><i>NXT window button</i> - Toto tla&#269;ítko, které je na <i>Controlleru</i> vlevo 
			naho&#345;e, otev&#345;e NXT okno, které obsahuje zálo&#382;ku <i>Memory</i> ur&#269;enou 
			pro správu pam&#283;ti NXT kostky a zálo&#382;ku <i>Communications</i> s p&#345;ehledem za&#345;ízení 
			p&#345;ipojených k PC.</li> </br>
			<li><i>Download button<i></li> - Tímto tla&#269;ítkem, které je vlevo dole, stáhnete program do 
			NXT kostky a následn&#283; ho z ní m&#367;&#382;ete spustit.</br>
			<li><i>Download and run button <i> - Toto tla&#269;ítko, které se nachází uprost&#345;ed <i>Controlleru</i>, 
			stáhne program do NXT kostky a poté ho spustí.</li> </br>
			<li><i>Download and run selected button <i> - Tímto tla&#269;ítkem, které najdete vpravo naho&#345;e, 
			stáhnete a spustíte jen &#269;ást va&scaron;eho programového kódu. M&#367;&#382;e se jednat o jeden 
			nebo n&#283;kolik blok&#367;. Tak m&#367;&#382;ete vyzkou&scaron;et, jak bude fungovat jen malá &#269;ást 
			va&scaron;eho programu, ani&#382; byste museli stáhnout celý program.</li> </br>
			<li><i>Stop button<i> - Toto tla&#269;ítko se nachází vpravo dole a slou&#382;í 
			k zastavení b&#283;&#382;ícího programu.  </li> </br> 
		  </ul>
		  
		  <b>8 - <i>Help & Navigation</i></b> - V této &#269;ásti se m&#367;&#382;ete p&#345;epínat pomocí 
		  dvou zálo&#382;ek mezi dv&#283;ma sekcemi. První zálo&#382;ka s názvem <i>Help tab</i> slou&#382;í jako nápov&#283;da. 
		  <i>Map tab</i> je druhá zálo&#382;ka, která slou&#382;í k získání p&#345;ehledu nad va&scaron;ím programem. </br> </br>
		  
		  <b>9 - <i>Robot Educator & My Portal</i></b> - Tato &#269;ást má také dv&#283; zálo&#382;ky. První zálo&#382;ka 
		  je pr&#367;vodce <i>Robot Educator</i>, kde najdete instrukce pro programování model&#367; <i>Robot Educator</i>. 
		  V druhé zálo&#382;ce <i>My portal</i> jsou dv&#283; tla&#269;ítka, která slou&#382;í pro p&#345;ístup na webové 
		  stránky, první na <a href="http://www.mindstormseducation.com">www.mindstormseducation.com</a> a druhé na   
		  <a href="http://www.legoengineering.com">www.legoengineering.com</a>.     
		  
	</div>
		  
</body>
</html>
