<html>
<!-- Created on: 6/25/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware">
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
</head>
<body>
		<div id="hlavicka">
		<p>Robotický seminá&#345; </p>
		</div>
	
		<div id="hlavni">
		  </br>	 
	 	  <h2> <u>Vytvo&#345;ení, ulo&#382;ení, otev&#345;ení programu</u></h2>
		  
		  <h3> <u>Vytvo&#345;ení nového programu</u></h3> 
		  
		   <ol>
		   		<li>Klikn&#283;te do textového pole s p&#345;eddefinovaným
				 názvem <i>&bdquo;Untitled-1&ldquo;</i> umíst&#283;né  v sekci <i>Start New Program</i>
				                             v úvodním okn&#283; (Obr. 1).</li> </br>		  
					  <center> <img src="obrazky/Obr. 1.13.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 1: Sekce Start New Program</font> </center> 						 
					</br>					 
											 
				<li>Sma&#382;te p&#345;eddefinovaný text a napi&scaron;te název va&scaron;eho 
				nového programu, nebo m&#367;&#382;ete ponechat p&#367;vodní název.</li> </br>
				<li>Klikn&#283;te na tla&#269;ítko <i> &bdquo;Go>>&ldquo;</i> a úvodní 
				okno se p&#345;epne na programovací plochu, kde budete umís&#357;ovat programovací bloky.
				 P&#345;i vytvá&#345;ení nového programu si v&scaron;imn&#283;te,
				   &#382;e v horní &#269;ásti programovacího okna se vytvo&#345;ila zálo&#382;ka s názvem,
				    který jste dali va&scaron;emu programu. M&#367;&#382;ete vytvo&#345;it více program&#367; 
					a pak mezi nimi p&#345;epínat pomocí t&#283;chto zálo&#382;ek nebo pomocí ikony programu 
					LEGO MINDSTORMS NXT se p&#345;epnout zp&#283;t na úvodní okno. Zálo&#382;ku lze zav&#345;
					ít &bdquo;k&#345;í&#382;kem&ldquo;, který je umíst&#283;ný uprost&#345;ed horní &#269;ásti
					 programovacího okna. Zálo&#382;ky 
                   pro p&#345;epínání mezi programovacími plochami a úvodním oknem jsou 
				   vid&#283;t na       Obr. 2.  </br> </br>	
				   
				    <center> <img src="obrazky/Obr. 1.14.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 2: Zálo&#382;ky pro p&#345;epínání mezi programy</font> </center> 	
				   	</br>
					
				   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Nový program lze také vytvo&#345;it tak, &#382;e kliknete na roletovou nabídku <i> File </i>
				    a zvolíte volbu <i> New </i>. Nebo m&#367;&#382;ete také vyu&#382;ít první tla&#269;ítko zleva, 
					které je umíst&#283;né na li&scaron;t&#283; pro rychle spu&scaron;t&#283;ní.
					 Poslední mo&#382;ností pro vytvo&#345;ení nového programu je pou&#382;ití klávesová zkratky Ctrl+N.
					 Nov&#283; vytvo&#345;ený program si v&#382;dy ulo&#382;te, ne&#382; ho budete chtít nahrát do NXT kostky. 	 
					 
					</br> </br>
					
					&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pokud je textové pole ozna&#269;eno jako na Obr. 1, tak podporuje pouze <i> Simple Text </i>. 
					Jestli&#382;e textové pole není takto ozna&#269;eno, tak podporuje celý text, 
					zahrnující znaky s diakritikou a asijské znaky. <i> Simple Text </i> znamená, &#382;e podporované znaky jsou velká a 
					 malá písmena A-Z, &#269;íslice 0-9, interpunkce a symboly, které jsou na Obr. 3. 
					 Pokud <i> Simple Text </i> textové pole obsahuje jiné ne&#382; dovolené znaky a symboly,
					  tak bude místo nich zobrazeno prázdné místo. </br> </br>
					  
					    <center> <img src="obrazky/Obr. 1.15.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 3: Simple Text &ndash; podporované znaky</font> </center> 	
					 
</li>	 
		   
		   </ol>	   
		   
		   
		  		  <h3> <u>Ulo&#382;ení programu</u></h3>   
				  
				  	  <ol>
					  <li> Klikn&#283;te na roletovou nabídku <i>File</i> a vyberte volbu <i>Save as</i>. </li>		 
					  </br> 
					  
					  <li>Objeví se okno s názvem (Obr. 4), kde po kliknutí do textového 
					  pole <i>File Name</i> m&#367;&#382;ete napsat vámi vymy&scaron;lený název programu. 
					  Ulo&#382;ený program bude 
                      mít p&#345;íponu *.rbt. Do textového pole m&#367;&#382;ete napsat název programu 
					  i bez této p&#345;ípony. Ta se pak sama automaticky po ulo&#382;ení p&#345;ipojí.</li>		
  					  <li>Pod textovým polem je textová oblast s názvem <i>Path</i>,
					   kde je napsaná p&#345;eddefinovaná cesta pro ulo&#382;ení nového programu. 
					   Cestu m&#367;&#382;ete zm&#283;nit pomocí tla&#269;ítka <i>Browse</i>.</li>	  
					   </br> 
					   
					   <li>Pro dokon&#269;ení procesu ulo&#382;ení klikn&#283;te na tla&#269;ítko <i>Save</i>. 
					   Pokud jste si to s ulo&#382;ením rozmysleli, tak pro uzav&#345;ení okna klikn&#283;te
					    na tla&#269;ítko <i>Cancel</i>.</li>	
						 </br>   </br> 
						&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;K ulo&#382;ení programu lze také vyu&#382;ít t&#345;etí tla&#269;ítko zleva, 
						které se nachází na li&scaron;t&#283; pro rychlé spu&scaron;t&#283;ní.
						 Kliknutím na n&#283;j se op&#283;t objeví okno <i>Save As</i> pro ulo&#382;ení.
						  P&#345;i prvém pou&#382;ití klávesové zkratky Ctrl+S se také vyvolá okno pro ulo&#382;ení.
						   P&#345;i op&#283;tovném pou&#382;ití klávesové zkratky Ctrl+S se bude program 
						   pr&#367;b&#283;&#382;n&#283; ukládat.	
						   
						  </br>   </br> 	 
    					 <center> <img src="obrazky/Obr. 1.16.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 4: Okno pro ulo&#382;ení souboru</font> </center> 	
					  
					  </ol>		  
					  
<h3> <u>Otev&#345;ení programu </u></h3> 

<ol>
 					   <li>V úvodním okn&#283; v sekci <i>Open Recent Program </i>(Obr. 5) se nachází rozbalovací nabídka.
					    Klikn&#283;te na &scaron;ipku umíst&#283;nou na levé stran&#283; rozbalovací nabídky.</li>	
						 </br> 	
					   <li>Rozbalí se seznam, kde jsou názvy program&#367;, na kterých jste nedávno pracovali.</li>
 						 </br>
					   <li>Klikn&#283;te na název programu, který chcete otev&#345;ít. </li>
		  				 </br>	
					   <li>Stiskn&#283;te tla&#269;ítko <i>&bdquo;GO>>&ldquo;</i> a otev&#345;e se daný program.</li>  
					   	 </br> </br>
						
						 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Jako bylo více zp&#367;sob&#367; pro vytvo&#345;ení a ulo&#382;ení programu, 
						tak i pro otev&#345;ení existuje více zp&#367;sob&#367;. Jednou z dal&scaron;ích mo&#382;ností, 
						jak lze otev&#345;ít program je, &#382;e kliknete na roletovou nabídku <i>File</i> a vyberete volbu<i> Open</i>.
						 Otev&#345;e se okno s adresá&#345;ovou strukturou, kde si najdete soubor, který chcete otev&#345;ít 
						 a stisknete tla&#269;ítko <i>OK</i>. Okno s adresá&#345;ovou strukturou lze také vyvolat pomocí
						  klávesové zkratky Ctrl+O nebo kliknutím na druhé tla&#269;ítko zleva na li&scaron;t&#283;
						   pro rychlé spu&scaron;t&#283;ní.	
						   
						     </br>   </br> 
							 <center> <img src="obrazky/Obr. 1.17.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 5: Sekce Open Recent Program</font> </center> 	 
						   
						   </ol>

	  

		</div>  
</body>																								

</html>
