<html>
<!-- Created on: 6/29/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware"> 
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
  
</head>
<body>

	<div id="hlavicka">
	<p>Robotický seminá&#345; </p>
	 </div>
	
		<div id="hlavni">
		   </br>	 
	 	   <h2> <u>Práce se soubory</u></h2>
		   
		   <h3> <u>Správa soubor&#367; a pam&#283;ti NXT kostky </u></h3> 	

 						   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ob&#269;as je zapot&#345;ebí spravovat
						    soubory a pam&#283;&#357; NXT kostky. M&#367;&#382;ete to ud&#283;lat ze zálo&#382;ku
							 <i>Memory</i> z okna <i>NXT</i> (Obr. 1), které spustíte tla&#269;ítkem z <i>Controlleru</i> umíst&#283;ným 
							 vlevo naho&#345;e. Zálo&#382;ka <i>Memory</i> poskytuje grafický p&#345;ehled vyu&#382;ití
							  pam&#283;ti NXT kostky. M&#367;&#382;ete poslat programy, zvuky, grafické a dal&scaron;í 
							  soubory z po&#269;íta&#269;e do NXT kostky. Také m&#367;&#382;ete kopírovat    
							    a mazat soubory, které jsou u&#382; na NXT kostce ulo&#382;ené.	 
 </br>  </br>
 							 <center> <img src="obrazky/memory.png"> </center>
		 				<center> <font size="2" color="#000066" face="arial">Obr. 1: Zálo&#382;ka Memory okna NXT</font> </center>  
</br>  </br>
						 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ka&#382;dá NXT kostka má dostupnou 
						 pam&#283;&#357; o velikosti zhruba 130,7 kB. &#268;ást pam&#283;ti         
						  je obsazena p&#345;íkladovými programy, grafickými a zvukovými soubory,
						   které jsou výrobcem nahrány na NXT za&#345;ízení.
						    Zbývá asi 56 kB pam&#283;ti pro soubory, které sami vytvo&#345;íte a stáhnete. 							
 
 
<h3> <u>	Smazání souboru </u></h3> 	
 
 					  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pokud p&#345;ekro&#269;íte 
					  velikost volné pam&#283;ti m&#367;&#382;ete smazat n&#283;jaké 
					  soubory z NXT kostky. Pomocí grafického p&#345;ehledu vyu&#382;ití 
					  pam&#283;ti na levé stran&#283; zálo&#382;ky zjistíte, který 
					  typ soubor&#367; zabírá v&#283;t&scaron;inu pam&#283;ti.
					   Klikn&#283;te na jméno kategorie p&#345;íslu&scaron;ného typu soubor&#367; a zobrazí
					                 se seznam soubor&#367; v dané kategorii. Klikn&#283;te na soubor ze seznamu,
									  který chcete smazat            a klikn&#283;te na tla&#269;ítko <i>Delete</i> 

<h3> <u>Smazání v&scaron;ech vytvo&#345;ených soubor&#367;</u></h3> 	
 
 					     &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;M&#367;&#382;ete smazat
						  v&scaron;echny va&scaron;e vytvo&#345;ené soubory a vy&#269;istit pam&#283;&#357; 
						  NXT kostky kliknutím na tla&#269;ítko <i>Delete All</i>. Sma&#382;ete tak v&scaron;echny 
						  soubory, které jste kdy poslali do NXT kostky a p&#345;eorganizuje se pam&#283;&#357;
						   tak, aby bylo co nejvíce volného místa pro nové soubory. Systémové soubory,
						    které byly v továrn&#283; p&#345;ednahrány, smazány nebudou. 			  

	   </div>

</body>
</html>
