<html>
<!-- Created on: 6/29/2010 -->
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <title>Návod na programování v NXT-G</title>
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="author" content="Unregistered User">
  <meta name="generator" content="AceHTML Freeware"> 
  <link rel="stylesheet" href="seminarRobot.css" type="text/css">
</head>
<body>
	<div id="hlavicka">	
	<p>Robotický seminá&#345; </p>
	</div>
	
		<div id="hlavni">
		   </br>	 
	 	   <h2> <u>Vlastní bloky</u></h2>	
		   
		   	<h3> <u>Tvorba vlastních blok&#367;</u></h3> 	
 
 							  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<i> My block builder</i> je funkcionalita, která vám dovoluje ozna&#269;it skupinu blok&#367;  
							                   na programovací plo&scaron;e a slou&#269;it je do jednoho bloku. 
											   Pro nový blok si m&#367;&#382;ete nastavit vlastní vzhled 
											   a po dokon&#269;ení ho budete moci najít na palet&#283; 
											   <i>Custom</i> pod ikonou<i> My blocks</i>. Nap&#345;íklad m&#367;&#382;ete 
											   vytvo&#345;it vlastní blok, který se bude jmenovat &bdquo;Pohyb robota&ldquo;.
											    Tento vá&scaron; blok vznikne slou&#269;ením bloku <i>Move</i>, který bude
												 &#345;ídit pohyb robota a bloku<i> Sound</i>, kdy robot bude vydávat n&#283;jaký
												  zvuk p&#345;i svém pohybu. To vám usnadní práci, pokud budete chtít u jiných 
												  robot&#367; 
							naprogramovat tu samou &#269;innost. V&scaron;e budete mít nastavené a vy jen blok p&#345;etáhnete
							 z palety <i>Custom</i> na programovací plochu.	 
							 
</br> </br>

 </ol>
<h3> <u>Vytvo&#345;ení vlastního bloku </u></h3> 	
 <ol>						 							   			  			 					 
						<li>Nejprve na programovací plochu umíst&#283;te bloky, které logicky pat&#345;í k sob&#283;. </li>		</br>		   
						   
					   <li>Vyberte bloky tak, &#382;e umístíte kurzor my&scaron;i do jednoho rohu pomyslného obdélníku, 
					   který bude obklopovat v&scaron;echny bloky, které chcete slou&#269;it. Podr&#382;te
					    stisknuté tla&#269;ítko my&scaron;i a p&#345;eje&#271;te kurzorem my&scaron;i 
						do prot&#283;j&scaron;ího rohu pomyslného obdélníku tak, aby byly ohrani&#269;eny v&scaron;echny 
						po&#382;adované bloky. Po uvoln&#283;ní tla&#269;ítka my&scaron;i by m&#283;ly být v&scaron;echny bloky,
						 které budou tvo&#345;it nový blok, ozna&#269;eny. Poznáte to tak, &#382;e hrany blok&#367; 
						 budou zbarveny mod&#345;e. Pamatujte si, &#382;e výb&#283;r, který bude zahrnovat bloky jen 
						 &#269;áste&#269;n&#283;, zp&#367;sobí také jejich ozna&#269;ení. Výb&#283;r blok&#367; 
						 m&#367;&#382;ete vid&#283;t na Obr. 1. </li>	 
</br> 

						<center> <img src="obrazky/Obr. 1.37.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 1: Výb&#283;r blok&#367; pro slou&#269;ení do jednoho bloku</font> </center>  
</br> </br>
						 <li>Pokud se vám povedlo bloky ozna&#269;it, tak klikn&#283;te na roletovou nabídku 
						 <i>Edit</i> a poté klikn&#283;te na podnabídku<i> Make</i> a <i>New My Block</i>. Zobrazí se okno pr&#367;
						 vodce <i>My Block Builder</i> (Obr. 2). Toto okno m&#367;&#382;ete také otev&#345;ít klinutím 
						 na tla&#269;ítko, které je první zleva na li&scaron;t&#283; s tla&#269;ítky pro
						  rychle spu&scaron;t&#283;ní. </li>

</br> </br>				  <center> <img src="obrazky/Obr. 1.38.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 2: Úvodní okno pr&#367;vodce My Block Builder</font> </center>  
						 
</br> </br>		  

						<li>V sekci <i>Block Name</i> je textové pole, kam napi&scaron;te název va&scaron;eho nového bloku.
						 V dal&scaron;í sekci, která je pojmenována <i>Block Description</i>, se nachází textové pole,
						  kde m&#367;&#382;ete napsat krátký popis, co vá&scaron; nový blok d&#283;lá.
						   Poslední sekce <i>Selected Blocks</i> vám ukazuje bloky, které jste vybrali. </li>

</br>
						  <li>Klikn&#283;te na tla&#269;ítko <i>Next</i> a p&#345;ejdete k návrhu ikony nového bloku (Obr. 3). 
						  P&#345;eta&#382;ením m&#367;&#382;ete dostat jednu nebo dv&#283; ikony ze sekce <i>Icons</i> do editovací 
						  oblasti v sekci <i>Icon Builder</i>. Klávesovými &scaron;ipkami lze doladit umíst&#283;ní ikony (nebo ikon) 
						  do finální pozice. Velikost ikony v editovací oblasti zm&#283;níte tak, &#382;e kurzor my&scaron;i
						   p&#345;esunete na jeden z jejích roh&#367;, kde je &#269;erný obdélní&#269;ek. Stiskn&#283;te a 
						   dr&#382;te levé tla&#269;ítko my&scaron;i. Pohybem my&scaron;i upravujete velikost ikony. 
						   Napravo od editovací oblasti je ukázán náhled, jaký bude vzhled va&scaron;eho nového bloku. </li>

</br> </br>

						<center> <img src="obrazky/Obr. 1.39.png"> </center> 
		 				<center> <font size="2" color="#000066" face="arial">Obr. 3: Okno pr&#367;vodce My Block Builder pro editaci vzhledu nové ikony </font> </center>  
</br> </br>

						<li>Kliknutím na tla&#269;ítko <i>Finish</i> dokon&#269;íte tvorbu va&scaron;eho nového bloku a na programovací 
						plo&scaron;e se ji&#382; bude nacházet vámi vytvo&#345;ený blok. Kdy&#382; byste cht&#283;li
						 blok nap&#345;íklad vyu&#382;ít v jiném programu, tak ho najdete na programovací palet&#283; 
						 v zálo&#382;ce <i>Custom</i>  pod ikonou<i> My Blocks</i>.  </li> 
</ol>

						&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Je dobré si uv&#283;domit, &#382;e ka&#382;dé vstupní
						 a výstupní datové spojení, které p&#345;ekro&#269;ilo pomyslný obdélník p&#345;i výb&#283;ru
						  blok&#367;, bude tvo&#345;it vstupní a výstupní zástr&#269;ku na v <i>Data hub</i> nabídce nového bloku.
						   Pokud chcete zm&#283;nit dispozice zástr&#269;ek u nového bloku, tak ho budete muset vytvo&#345;it znovu, 
						   ale tentokrát se správnými zástr&#269;kami a tomu odpovídající datová spojení, která vychází
						    z oblasti výb&#283;ru pomyslným obdélníkem.



 
				
<h3> <u>Úprava vytvo&#345;eného bloku</u></h3> 	
		
 						  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kdy&#382; byste cht&#283;li zm&#283;nit obsahu va&scaron;eho 
						  vytvo&#345;eného bloku, tak to provedete tak,           &#382;e na n&#283;j na programovací plo&scaron;e
						   dvakrát kliknete nebo ho ozna&#269;íte kliknutím na n&#283;j a z roletové nabídky<i> Edit</i> vyberete
						    podnabídku <i>Edit Selected My Block</i>. Pokud chcete zm&#283;nit pouze vzhled programovacího bloku, 
							tak na n&#283;j na programovací plo&scaron;e klikn&#283;te. Pak z roletové nabídky<i> Edit</i> vyberte
							 podnabídku<i> Edit My Block Icon</i>. Tím se spustí <i>My block Builder</i>, kde m&#367;&#382;ete provést zm&#283;ny.
 

 
 <h3> <u>Správa palety Custom </u></h3>
 Pro správu <i>Custom</i> palety je pot&#345;eba vykonat následující kroky:  	
 <ol>					
 						  <li>Klikn&#283;te na roletovou nabídku <i>Edit</i> a vyberte podnabídku <i>Manage Custom Palette</i>. </li> </br>
						  <li>Tím otev&#345;ete okno s adresá&#345;ovou strukturou va&scaron;eho po&#269;
						  íta&#269;e a budete se nacházet          ve slo&#382;ce <i>Blocks</i>, kde jsou dv&#283; podslo&#382;ky
						   <i>My Blocks</i> a <i>Web Blocks</i>. Do slo&#382;ky My Blocks si m&#367;&#382;ete p&#345;idat bloky, 
						   které jste nap&#345;íklad od n&#283;koho obdr&#382;eli. Zárove&#328; je zde také m&#367;&#382;ete 
						   smazat. </li>  </br>	
 </ol> 	
 						   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; V palet&#283; <i>Custom </i>se nachází dv&#283; p&#345;eddefinované 
						   podsekce <i>My Blocks</i> a <i>Web Downloads</i>. Vy máte mo&#382;nost vytvo&#345;it vlastní podsekci a to tak,
						    &#382;e ve slo&#382;ce <i>Blocks</i> vytvo&#345;íte novou slo&#382;ku. Máte mo&#382;nost zm&#283;nit
							 vzhled vlastní podsekce tak, &#382;e do nov&#283; vytvo&#345;ené slo&#382;ky, která odpovídá nové
							  podsekci, umístíte dva obrázkové soubory s p&#345;íponou PNG (Portable Network Graphics)
							   o rozm&#283;rech 45x45 pixel&#367;. První soubor musí být pojmenován <i>PaletteIcon.png</i> a
							    druhý <i>PaletteIconHilight.png</i>. Pro specifikování nápov&#283;dy, která se zobrazí p&#345;i 
								najetí kurzoru my&scaron;i nad novou podsekci, je pot&#345;eba do stejné slo&#382;ky
								 umístit textový soubor s názvem PaletteIcon.txt, který bude obsahovat text nápov&#283;dy.	
 
 
			  
			  
			  
		</div>

</body>
</html>
